bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
/* PLL angle correction gain (per fast-loop tick): 2pi x BW x Ts */
#define PLL_CORRECTION_GAIN  (6.28318530718f * PLL_CORRECTION_BW_HZ * FOC_TS_FAST_S)

/* ADC zero-current offset calibration (sampled while motor is off) */
#define CAL_SAMPLES  1024U
#define CAL_SHIFT    10U
static uint32_t     s_ia_accum;
static uint32_t     s_ib_accum;
static uint16_t     s_cal_count;
static uint16_t     s_ia_offset;
static uint16_t     s_ib_offset;
static bool         s_cal_done;

/* Stall timer (slow loop ticks) */
static uint32_t     s_stall_ctr;

/* I/f → closed-loop transition state */
static bool         s_cl_active;    /* True after PLL lock → speed PI + PLL angle */
static uint32_t     s_cl_lock_ctr;  /* Consecutive ticks PLL tracks OL within tolerance */

/* Phase current OC debounce (software OC since ibusRaw=0 at PWM valley) */
#define FOC_OC_DEBOUNCE  48U  /* 48 ticks @ 24kHz = 2ms */
static uint16_t     s_foc_oc_ctr;

/* Helper: get PLL rotor angle (corrected for BEMF->rotor offset) */
static inline float pll_rotor_angle(void)
{
    float a = s_pll.theta_est - PLL_ANGLE_OFFSET;
    if (a < 0.0f)            a += 6.28318530718f;
    if (a >= 6.28318530718f) a -= 6.28318530718f;
    return a;
}

#if FEATURE_SMO
static inline float smo_rotor_angle(void)
{
    float a = s_pll_smo.theta_est - PLL_ANGLE_OFFSET;
    if (a < 0.0f)            a += 6.28318530718f;
    if (a >= 6.28318530718f) a -= 6.28318530718f;
    return a;
}
#endif

/* Forward declarations */
static void foc_startup_reset(void);

static void foc_startup_reset(void)
{
    s_theta_ol     = 0.0f;
    s_omega_ol     = 0.0f;
    s_ovr_released = false;
    s_iq_ramp_ctr  = 0;
    s_align_ctr    = 0;
    s_cl_active    = false;
    s_cl_lock_ctr  = 0;
    s_foc_oc_ctr   = 0;
    pi_reset(&s_pid_d);
    pi_reset(&s_pid_q);
    pi_reset(&s_pid_spd);
    s_iq_ref    = 0.0f;
    s_stall_ctr = 0;
    flux_est_reset(&s_flux_est);
#if FEATURE_SMO
    smo_reset(&s_smo);
    pll_reset(&s_pll_smo);
#endif
#if FEATURE_MXLEMMING
    mxl_reset(&s_mxl);
#endif
}

static inline float counts_to_amps_cal(uint16_t raw, uint16_t offset)
{
    /* Negate: OA1/OA2 inverting topology on MCLV-48V-300W DIM.
     * AN1292 reference uses (HALF_ADC_COUNT - ADC_DATA) for same reason. */
    return -((float)(int16_t)(raw - offset)) * CURRENT_SCALE_A_PER_COUNT;
}

static inline float counts_to_vbus(uint16_t raw)
{
    return (float)raw * VBUS_SCALE_V_PER_COUNT;
}
#endif /* FEATURE_FOC */

#if FEATURE_FOC_V2 || FEATURE_FOC_V3 || FEATURE_FOC_AN1078
/* Reuse same helper for v2/v3/AN1078 telemetry raw→amps conversion */
static inline float v2_counts_to_amps(uint16_t raw, uint16_t offset)
{
    return -((float)(int16_t)(raw - offset)) * CURRENT_SCALE_A_PER_COUNT;
}
#endif

#if FEATURE_IF_STARTUP
/* ── I-f current-controlled spin-up (Milestone 1) ────────────────────────────
 * Reuses the standalone FOC primitives (Clarke/Park/SVPWM/PI) to drive a
 * regulated current vector at a forced, ramping angle. Because SVPWM sets the
 * differential phase voltage, the effective drive goes BELOW MIN_DUTY — so the
 * motor spins up smoothly with Ibus bounded at ifCurrentCa (no 22A slam) and no
 * deadtime floor. M1 = align → ramp to IF_HANDOFF and HOLD (no 6-step handoff). */
#include "foc/foc_types.h"
#include "foc/clarke.h"
#include "foc/park.h"
#include "foc/svpwm.h"
#include "foc/pi_controller.h"

static PI_t     s_if_pid_d, s_if_pid_q;
static float    s_if_theta;        /* forced electrical angle (rad) */
static float    s_if_omega;        /* forced electrical speed (elec rad/s) */
static uint16_t s_if_alignCtr;     /* ticks holding angle before the speed ramp */
static bool     s_if_atHandoff;    /* reached IF_HANDOFF (telemetry/M2 trigger) */
static bool     s_if_bridgeUp;     /* false until overrides released (after latch) */
/* MON current-offset calibration. The fixed IF_ADC_MIDPOINT (2048) is wrong on
 * this board — the MON channels rest at ia~4085, ib~84 (ib is starved by the
 * 1MHz HWZC channels unless they're disabled). Sample the TRUE rest over
 * IF_CAL_TICKS at zero current and subtract that instead of 2048. */
/* Phase-current offset calibration. With the CMP1/CMP2 root-cause fix
 * (hal_comparator.c — their input muxes railed OA1/OA2 in the 6-step build),
 * the op-amps should rest near 2048; the cal measures the TRUE rest anyway. */
static float    s_if_ia_off, s_if_ib_off;
static int32_t  s_if_ia_acc, s_if_ib_acc;
static uint16_t s_if_calCtr;
#define IF_CAL_TICKS  48u          /* ~2ms of zero-current rest sampling */

/* Self-contained ADC conversions: the FEATURE_FOC counts_to_* helpers, the
 * calibrated current offset, AND garuda_foc_params.h itself are all compiled
 * out in the pure 6-step build, so define the scales here from the documented
 * shunt/divider values (shunt 3mΩ × OA gain 8.3 [WS5: stock AK512 DIM, was
 * 24.95], Vref 3.3, FS 4095, Vbus divider 23.2). Fixed 2048 bias matches the
 * 6-step convention; negation matches the FOC sign convention the reused gains
 * were tuned with. */
#define IF_ADC_MIDPOINT   2048.0f
#define IF_CURRENT_SCALE  (3.3f / (4095.0f * 0.003f * 8.3f))   /* A per count (WS5: gain 8.3) */
#define IF_VBUS_SCALE     (3.3f * 23.2f / 4095.0f)               /* V per count */
/* Sign for the MON phase-current channels. The 6-step path reads them as
 * (raw-2048) POSITIVE (no negation, unlike the FOC MAIN channels). Wrong sign
 * = positive feedback = runaway → voltage clamp → full-scale current spike.
 * Diagnostic proved the MON channels are INVERTING (like the FOC MAIN
 * channels): +vd produced -idmeas. So negate (-1), same as the FOC path. */
#define IF_CURRENT_SIGN   (-1.0f)
static inline float if_raw_to_amps(uint16_t raw)
{
    return IF_CURRENT_SIGN * ((float)raw - IF_ADC_MIDPOINT) * IF_CURRENT_SCALE;
}
static inline float if_raw_to_vbus(uint16_t raw)
{
    return (float)raw * IF_VBUS_SCALE;
}

static void IF_StartupInit(void)
{
    float vbus = if_raw_to_vbus(garudaData.vbusRaw);
    if (vbus < 1.0f) vbus = 1.0f;
    /* Clamp Vd/Vq. Cap at 3V for the first real-current run: plenty to spin to
     * ~11k (BEMF there is ~1.5V) yet bounds a worst-case wrong-sign current
     * (the firmware OC/UV tiers backstop). Raise toward vbus*0.95*IF_INV_SQRT3
     * once confirmed stable. */
    float vclamp = vbus * 0.95f * IF_INV_SQRT3;
    if (vclamp > 3.0f) vclamp = 3.0f;
    float kp = (float)gspParams.focKpDqMilli * 0.001f;  /* tuned for this motor */
    float ki = (float)gspParams.focKiDq;
    pi_init(&s_if_pid_d, kp, ki, -vclamp, vclamp);
    pi_init(&s_if_pid_q, kp, ki, -vclamp, vclamp);
    s_if_theta     = 0.0f;
    s_if_omega     = 0.0f;
    s_if_alignCtr  = 0;
    s_if_atHandoff = false;
    s_if_bridgeUp  = false;
    /* Offset cal: seed with the nominal midpoint; refined in the cal window. */
    s_if_ia_off = IF_ADC_MIDPOINT; s_if_ib_off = IF_ADC_MIDPOINT;
    s_if_ia_acc = 0; s_if_ib_acc = 0; s_if_calCtr = 0;
    /* ADC channels are FOC-configured from BOOT (hal_adc.c, before ADC ON):
     * AD1CH0=OA1(ia), AD2CH0=OA2(ib); no 1MHz HWZC / MON channels in this
     * build. Nothing to reconfigure here — the earlier runtime PINSEL swap
     * (with ADON=1) is exactly what read OA2 as railed garbage. */
#if FEATURE_SINE_STARTUP
    garudaData.sine.active = false;     /* I-f owns the modulator now (only exists with sine) */
#endif
    /* Clean bring-up, part 1 (in this T1-ISR call): force override-LOW — undoes
     * STARTUP_Init/SineInit's drive AND keeps the low-sides on so the bootstrap
     * caps stay charged — then load BALANCED 0V duties into the buffer. We do
     * NOT release the overrides here: doing so before the balanced duty has
     * LATCHED makes the bridge briefly drive a stale/unbalanced duty → the UV
     * glitch. Part 2 (first IF_StartupTick) releases them once latched. */
    HAL_MC1PWMDisableOutputs();
    HAL_PWM_SetDutyFloat3Phase(0.5f, 0.5f, 0.5f);
}

static void IF_StartupTick(uint16_t raw_ia, uint16_t raw_ib)
{
    /* Clean bring-up, part 2: on the first tick the balanced duty loaded in
     * IF_StartupInit has now latched (≥1 PWM boundary elapsed since that T1
     * call), so release the overrides — the bridge goes override-low → balanced
     * 0V with no stale-duty transient. Hold balanced (skip the loop) this one
     * tick so the released bridge settles at 0V before current is commanded. */
    if (!s_if_bridgeUp) {
        HAL_PWM_ReleaseAllOverrides();
        HAL_PWM_SetDutyFloat3Phase(0.5f, 0.5f, 0.5f);
        s_if_bridgeUp = true;
        return;
    }

