bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
#if HWZC_THRESH_BIAS_DOWN
        /* TEMP (VEX/1407 @10V): pull the published detection threshold DOWN by a
         * fixed bias toward the true neutral. Applied to the OUTPUT only — the IIR
         * state (zcThreshSmooth) stays unbiased so the bias doesn't compound. */
        garudaData.bemf.zcThreshold =
            (garudaData.bemf.zcThreshold > HWZC_THRESH_BIAS_DOWN)
                ? (uint16_t)(garudaData.bemf.zcThreshold - HWZC_THRESH_BIAS_DOWN) : 0;
#endif

#if FEATURE_HWZC_FILTER_COMP
#if GARUDA_TARGET_AK512
        /* AK512: filter-comp amplitude = TRUE measured BEMF swing, NOT
         * zcThreshold. zcThreshold is the duty*Vbus neutral DC level; feeding
         * it made the comp offset scale with DUTY -> positive feedback (timing
         * error -> current -> duty -> bigger offset -> more advance -> more
         * error) that ran the 510 into regen above ~120k. The peak
         * |float - neutral| (bemfDevPeak, accumulated in the bemfRaw block
         * below) is duty-independent and tracks the real rotor BEMF, so
         * offset = amp*omega*tau stays the pure RC-lag correction at all
         * speeds. Latch once per sector on step change; IIR ~32 sectors. */
        {
            uint8_t step = garudaData.currentStep;
            if (garudaData.bemf.ampPrevStep != step) {
                garudaData.bemf.ampPrevStep = step;
                uint16_t pk = garudaData.bemf.bemfDevPeak;
                garudaData.bemf.bemfDevPeak = 0;   /* reset for the new sector */
                if (pk) {
                    if (garudaData.bemf.zcAmpForFilterComp == 0)
                        garudaData.bemf.zcAmpForFilterComp = pk;
                    else {
                        int32_t dAmp = (int32_t)pk
                                     - (int32_t)garudaData.bemf.zcAmpForFilterComp;
                        garudaData.bemf.zcAmpForFilterComp = (uint16_t)(
                            (int32_t)garudaData.bemf.zcAmpForFilterComp + (dAmp >> 5));
                    }
                }
            }
        }
#else
        /* 106 (UNCHANGED, bench-proven to 232k): slow IIR of zcThreshold. */
        if (garudaData.bemf.zcAmpForFilterComp == 0) {
            garudaData.bemf.zcAmpForFilterComp = garudaData.bemf.zcThreshold;
        } else {
            int32_t ampDelta = (int32_t)garudaData.bemf.zcThreshold
                             - (int32_t)garudaData.bemf.zcAmpForFilterComp;
            garudaData.bemf.zcAmpForFilterComp =
                (uint16_t)((int32_t)garudaData.bemf.zcAmpForFilterComp
                           + (ampDelta >> 11));   /* ~46 ms time constant */
        }
        if (garudaData.state != ESC_CLOSED_LOOP) {
            garudaData.bemf.zcAmpForFilterComp = garudaData.bemf.zcThreshold;
        }
#endif
#endif

#if FEATURE_ADC_CMP_ZC
        /* Live CMPLO refresh while HWZC is actively watching for a crossing.
         * Without this, CMPLO is only written at OnCommutation, so it stays
         * stale for up to one sector period (~91 µs at 100k eRPM, much longer
         * at low speed). Updating every 24 kHz tick tracks Vbus sag and duty
         * ramp mid-sector, which matters under load / during pot slew.
         *
         * Safety:
         *   - Gated on HWZC_WATCHING — during BLANKING/COMM_PENDING the
         *     comparator IE is disabled anyway.
         *   - CMPLO write is atomic (single 32-bit SFR).
         *   - CMPMOD is left untouched (set per-commutation in OnCommutation).
         *   - Deadband applied per-polarity, matching OnCommutation semantics.
         */
        if (garudaData.hwzc.enabled
            && garudaData.hwzc.phase == HWZC_WATCHING)
        {
            int8_t pol = commutationTable[garudaData.currentStep].zcPolarity;
            uint16_t t = garudaData.bemf.zcThreshold;
            /* Filter-lag pre-distortion mirrors what HWZC_OnCommutation applied
             * — keep the live refresh in lockstep so CMPLO stays compensated
             * as zcThreshold drifts with Vbus/duty mid-sector. */
            t = HWZC_ApplyFilterComp(&garudaData, t, (pol > 0));
            if (pol > 0)
                t = (t + HWZC_CMP_DEADBAND < 4095) ? t + HWZC_CMP_DEADBAND : 4095;
            else
                t = (t > HWZC_CMP_DEADBAND) ? t - HWZC_CMP_DEADBAND : 0;
            HAL_ADC_UpdateComparatorThreshold(garudaData.hwzc.activeCore, t);
        }
#endif
    }
#else
    garudaData.bemf.zcThreshold = garudaData.vbusRaw >> 1;
#endif

#if FEATURE_BEMF_CLOSED_LOOP
    /* Store floating phase ADC value in bemfRaw with validity tracking */
    {
        uint8_t fp = commutationTable[garudaData.currentStep].floatingPhase;
        if (fp == FLOATING_PHASE_B)
        {
            garudaData.bemf.bemfRaw = phaseB_val;
            garudaData.bemf.bemfSampleValid = true;
        }
        else if (garudaData.bemf.ad2SettleCount > 0)
        {
            garudaData.bemf.bemfRaw = phaseAC_val;
            garudaData.bemf.bemfSampleValid = false;
            garudaData.bemf.ad2SettleCount--;
        }
        else
        {
            garudaData.bemf.bemfRaw = phaseAC_val;
            garudaData.bemf.bemfSampleValid = true;
        }

#if FEATURE_HWZC_FILTER_COMP && GARUDA_TARGET_AK512
        /* Accumulate the TRUE BEMF swing for the filter-comp amplitude (latched
         * per sector by the block above): peak |float - neutral| while WATCHING,
         * BOTH polarities. Duty-independent -> no positive-feedback runaway. */
        if (garudaData.hwzc.enabled
            && garudaData.hwzc.phase == HWZC_WATCHING
            && garudaData.bemf.bemfSampleValid)
        {
            uint16_t b  = garudaData.bemf.bemfRaw;
            uint16_t th = garudaData.bemf.zcThreshold;
            uint16_t dev = (b > th) ? (uint16_t)(b - th) : (uint16_t)(th - b);
            if (dev > garudaData.bemf.bemfDevPeak)
                garudaData.bemf.bemfDevPeak = dev;
        }
#endif

#if FEATURE_ADC_CMP_ZC
        /* Diagnostic: falling-sector OFF-center BEMF envelope. Capture bemfRaw
         * (OFF-center floating sample) only while a FALLING sector is in the
         * WATCHING window — proves whether the falling crossing is visible at
         * OFF-center (envelope brackets zcThreshold) vs the silent ON-time
         * comparator. Cheap: 2 compares per tick, diagnostic only. */
        if (garudaData.hwzc.enabled
            && garudaData.hwzc.phase == HWZC_WATCHING
            && garudaData.bemf.bemfSampleValid
            && commutationTable[garudaData.currentStep].zcPolarity < 0)
        {
            uint16_t vfo = garudaData.bemf.bemfRaw;
            if (vfo < garudaData.bemf.fallOffBemfMin) garudaData.bemf.fallOffBemfMin = vfo;
            if (vfo > garudaData.bemf.fallOffBemfMax) garudaData.bemf.fallOffBemfMax = vfo;

