bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
#if FEATURE_VARIABLE_BEMF_TRIGGER
    /* WS3: recompute the BEMF ADC sample point (PG1TRIGA) from the applied
     * duty, once per ISR (takes effect next PWM cycle). Defaults reproduce
     * the fixed LOOPTIME_TCY/2 point (basePct=50, shiftQ=0). */
    {
        uint32_t triga = (uint32_t)LOOPTIME_TCY * RT_BEMF_TRIG_BASE_PCT / 100u;
        uint8_t  dutyPct = (uint8_t)((uint32_t)garudaData.duty * 100u / LOOPTIME_TCY);
        if (RT_BEMF_TRIG_SHIFT_Q > 0 && dutyPct > RT_BEMF_TRIG_DUTY_THRESH_PCT)
        {
            triga += (uint32_t)(LOOPTIME_TCY / 256u) * RT_BEMF_TRIG_SHIFT_Q
                   * (uint32_t)(dutyPct - RT_BEMF_TRIG_DUTY_THRESH_PCT) / 100u;
        }
        HAL_PWM_SetBemfTrigger(triga);   /* clamps to MPER-1 internally */
    }
#endif /* FEATURE_VARIABLE_BEMF_TRIGGER */

#if FEATURE_FOC
    /* ── FOC control path — replaces ENTIRE 6-step state machine ──
     * Architecture from RK1 (proven on A2212 1400KV):
     *   - Inline modular calls (no MCAPP_FOCStateMachine black box)
     *   - V/f voltage-mode with gradual PLL angle correction
     *   - POT=0 → motor coasts to stop; POT>0 → resumes (no re-arm)
     *   - No ESC_RUNNING state — PLL correction makes CL implicit
     */
    {
        /* Convert ADC counts → physical units using calibrated offsets */
        float ia    = counts_to_amps_cal(raw_ia, s_ia_offset);
        float ib    = counts_to_amps_cal(raw_ib, s_ib_offset);
        s_vbus      = counts_to_vbus(garudaData.vbusRaw);

        /* Dynamic PI voltage clamp — must match circular limiter (Vbus/sqrt(3))
         * so anti-windup engages at the real output ceiling, not 1.73x above it. */
        {
            float vclamp = s_vbus * 0.95f * 0.577350269f;
            s_pid_d.out_max =  vclamp;
            s_pid_d.out_min = -vclamp;
            s_pid_q.out_max =  vclamp;
            s_pid_q.out_min = -vclamp;
        }

        /* Throttle source: use garudaData.throttle (already muxed above) */
        uint16_t throttle_raw = garudaData.throttle;

        /* State dispatch */
        ESC_STATE_T state = garudaData.state;

        if (state == ESC_IDLE || state == ESC_ARMED)
        {
            /* Outputs off — PWM overrides already asserted */
            s_ovr_released = false;

            /* ADC zero-current offset calibration (motor off → no current) */
            if (!s_cal_done) {
                s_ia_accum += raw_ia;
                s_ib_accum += raw_ib;
                if (++s_cal_count >= CAL_SAMPLES) {
                    s_ia_offset = (uint16_t)(s_ia_accum >> CAL_SHIFT);
                    s_ib_offset = (uint16_t)(s_ib_accum >> CAL_SHIFT);
                    s_cal_done  = true;
                }
            }

            goto foc_slow_loop;
        }
        else if (state == ESC_CLOSED_LOOP)
        {
            /* ── I/f (current-forced) sensorless FOC ─────────────────────
             * PI current controllers active from tick 0.
             * Phase 1 (alignment): θ=0 fixed, Iq ramps 0→ALIGN_IQ.
             * Phase 2 (I/f OL):    θ forced at pot speed, Id=0 + Iq=RAMP_IQ.
             * Phase 3 (CL):        PLL angle, speed PI → Iq reference.
             *
             * Key advantage over V/f: on low-Rs motors (A2212, 0.065Ω),
             * any angle error θ_err causes Id_waste = V*sin(θ_err)/Rs.
             * V/f cannot correct this (voltage is set, not current).
             * I/f commands Id=0 and PI instantly cancels d-axis waste. */

            /* Release PWM overrides once at CLOSED_LOOP entry */
            if (!s_ovr_released) {
                HAL_PWM_ReleaseAllOverrides();
                s_ovr_released = true;
            }

#if FOC_DIAG_PWM_TEST == 1
            /* ── DIAG 1: PWM-only — 50% duty, no FOC math ──────── */
            HAL_PWM_SetDutyFloat3Phase(0.5f, 0.5f, 0.5f);
            garudaData.focSubState = 99;
            goto foc_slow_loop;
#elif FOC_DIAG_PWM_TEST == 2
            /* ── DIAG 2: Open-loop voltage — tests current sensing ─
             * Applies fixed Vq=0.2V at θ=0 (no PI, no feedback).
             * Expected: Iq ≈ Vq/Rs = 0.2/0.065 = 3.1A (POSITIVE).
             * If Iq is NEGATIVE → current sense polarity is inverted.
             * If Iq ≈ 0 → current sensing not working.
             * focSubState=98 confirms this code path. */
            {
                float vq_test = 0.2f;  /* 0.2V → ~3A on A2212 */
                float theta_test = 0.0f;

                /* Read + convert currents for telemetry */
                AlphaBeta_t iab_diag;
                clarke_transform(ia, ib, &iab_diag);
                DQ_t idq_diag;
                park_transform(&iab_diag, theta_test, &idq_diag);

                /* Fixed voltage — no PI */
                DQ_t vdq_diag = { .d = 0.0f, .q = vq_test };
                AlphaBeta_t vab_diag;
                inv_park_transform(&vdq_diag, theta_test, &vab_diag);
                float da2, db2, dc2;
                svpwm_update(vab_diag.alpha, vab_diag.beta, s_vbus, &da2, &db2, &dc2);
                HAL_PWM_SetDutyFloat3Phase(da2, db2, dc2);

                /* Telemetry: pack id/iq into focIa/focIb for easy reading */
                garudaData.focIa    = idq_diag.d;  /* expect ~0 */
                garudaData.focIb    = idq_diag.q;  /* expect ~+3A if polarity OK */
                garudaData.focTheta = theta_test;
                garudaData.focVbus  = s_vbus;
                garudaData.focSubState = 98;
            }
            goto foc_slow_loop;
#elif FOC_DIAG_PWM_TEST == 3
            /* ── DIAG 3: FOC with PI, no feedforward ────────────── */
            /* Falls through to normal FOC but feedforward is zeroed below */
#endif

            /* ── Angle + Current Reference Management ──────────────── */
            bool in_align = (s_align_ctr < STARTUP_ALIGN_TICKS);
            float theta_drive;
            float id_ref = 0.0f;
            float iq_ref;

            if (in_align) {
                /* Phase 1: Alignment at θ=0 with gradual Iq ramp.
                 * Ramp prevents L/R transient spike (L/R=0.46ms for A2212).
                 * Iq at θ=0 creates field at 90° elec → rotor locks there. */
                s_align_ctr++;
                s_theta_ol = 0.0f;
                s_omega_ol = 0.0f;
                theta_drive = 0.0f;
                float align_frac = (float)s_align_ctr / (float)STARTUP_ALIGN_TICKS;
                iq_ref = STARTUP_ALIGN_IQ_A * align_frac;

            } else if (!s_cl_active) {
                /* Phase 2: I/f open-loop — forced angle + PI current control.
                 * POT controls speed target, slew-rate limited. PI maintains
                 * Id=0 and Iq=RAMP_IQ. No V/f formula — PI computes voltage. */
                float pot_target;
                if (throttle_raw < THROTTLE_DEADBAND) {
                    pot_target = 0.0f;
                } else {
                    float pot_frac = (float)(throttle_raw - THROTTLE_DEADBAND)
                                   / (4095.0f - (float)THROTTLE_DEADBAND);
                    pot_target = pot_frac * STARTUP_MAX_OL_RAD_S;
                }

                /* Slew-rate limited speed ramp */
                float max_delta = STARTUP_RAMP_RATE_RPS2 * FOC_TS_FAST_S;
                if (s_omega_ol < pot_target) {
                    s_omega_ol += max_delta;
                    if (s_omega_ol > pot_target) s_omega_ol = pot_target;
                } else if (s_omega_ol > pot_target) {
                    s_omega_ol -= max_delta;
                    if (s_omega_ol < pot_target) s_omega_ol = pot_target;
                }

                /* Advance forced angle */
                s_theta_ol += s_omega_ol * FOC_TS_FAST_S;
                if (s_theta_ol >= 6.28318530718f) s_theta_ol -= 6.28318530718f;
                theta_drive = s_theta_ol;

                /* I/f current: ramp from ALIGN_IQ to RAMP_IQ over IQ_RAMP_TICKS */
                if (s_iq_ramp_ctr < STARTUP_IQ_RAMP_TICKS) {
                    s_iq_ramp_ctr++;
                    float frac = (float)s_iq_ramp_ctr / (float)STARTUP_IQ_RAMP_TICKS;
                    iq_ref = STARTUP_ALIGN_IQ_A
                           + (STARTUP_RAMP_IQ_A - STARTUP_ALIGN_IQ_A) * frac;
                } else {
                    iq_ref = STARTUP_RAMP_IQ_A;
                }

#if FEATURE_CLOSED_LOOP
                /* PLL angle correction + CL transition check.
                 * Observer lag compensation: BEMF EMA introduces phase lag
                 * that makes PLL trail the true rotor. Compensate forward. */
                if (s_omega_ol >= STARTUP_HANDOFF_RAD_S) {
                    float pll_rotor = pll_rotor_angle();

                    /* Compensate observer EMA phase lag */
                    float lag_comp = OBS_LAG_COEFF * s_omega_ol * FOC_TS_FAST_S;
                    if (lag_comp > OBS_LAG_COMP_MAX_RAD) lag_comp = OBS_LAG_COMP_MAX_RAD;
                    pll_rotor += lag_comp;
                    if (pll_rotor >= 6.28318530718f) pll_rotor -= 6.28318530718f;

