bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
        /* Populate duty for telemetry: max of 3 SVPWM phase duties */
        {
            float dmax = da_v2;
            if (db_v2 > dmax) dmax = db_v2;
            if (dc_v2 > dmax) dmax = dc_v2;
            garudaData.duty = (uint32_t)(dmax * LOOPTIME_TCY);
        }

#if FEATURE_BURST_SCOPE
        /* Write burst scope sample from ISR-local FOC state */
        {
            SCOPE_SAMPLE_T ss;
            ss.ia    = (int16_t)(garudaData.focIa * 1000.0f);
            ss.ib    = (int16_t)(garudaData.focIb * 1000.0f);
            ss.id    = (int16_t)(s_foc_v2.id_meas * 1000.0f);
            ss.iq    = (int16_t)(s_foc_v2.iq_meas * 1000.0f);
            ss.vd    = (int16_t)(s_foc_v2.vd * 100.0f);
            ss.vq    = (int16_t)(s_foc_v2.vq * 100.0f);
            ss.theta = (int16_t)(s_foc_v2.theta * 10000.0f);
            ss.obs_x1 = (int16_t)(s_foc_v2.obs.x1 * 100000.0f);
            ss.obs_x2 = (int16_t)(s_foc_v2.obs.x2 * 100000.0f);
            /* Omega ×1 scaling (1 rad/s resolution, range ±32767).
             * ×10 overflows int16 at 3276 rad/s — A2212 reaches 6000+. */
            {
                float omega_clamped = s_foc_v2.omega_pll;
                if (omega_clamped > 32767.0f) omega_clamped = 32767.0f;
                if (omega_clamped < -32768.0f) omega_clamped = -32768.0f;
                ss.omega = (int16_t)(omega_clamped);
            }
            ss.mod_index = (int16_t)(garudaData.focModIndex * 10000.0f);
            ss.flags  = (s_foc_v2.cl_active ? 0x01 : 0x00)
                      | ((garudaData.state == ESC_FAULT) ? 0x02 : 0x00)
                      | (((uint8_t)s_foc_v2.mode & 0x07) << 2);
            ss.state  = (uint8_t)garudaData.state;
            ss.tick_lsb = (uint16_t)(garudaData.systemTick & 0xFFFF);
            Scope_WriteSample(&ss);
        }
#endif
#endif
    } /* end FOC v2 scope */
#elif FEATURE_FOC_V3
    /* ── FOC v3 control path — SMO observer + OL ramp startup ──────
     * Architecture: Sliding Mode Observer + Tustin PI + SVPWM.
     * State machine: IDLE → ARMED → ALIGN → OL_RAMP → CLOSED_LOOP
     */
    {
        /* Sync mode from main loop state changes */
        if (garudaData.state == ESC_ARMED && s_foc_v3.mode == V3_IDLE) {
            s_foc_v3.mode = V3_ARMED;
            s_foc_v3.arm_ctr = 0;
        } else if (garudaData.state == ESC_IDLE &&
                   s_foc_v3.mode != V3_IDLE) {
            s_foc_v3.mode = V3_IDLE;
            s_foc_v3.cal_done = false;
            s_foc_v3.cal_count = 0;
            s_foc_v3.cal_accum_a = 0;
            s_foc_v3.cal_accum_b = 0;
        }

        /* Re-init FOC with updated motor params (after profile load) */
        if (gspFocReinitNeeded && s_foc_v3.mode == V3_IDLE) {
            FOC_MotorParams_t mp = BuildFocMotorParams();
            foc_v3_init(&s_foc_v3, &mp);
            gspFocReinitNeeded = false;
        }

        uint16_t throttle_v3 = garudaData.throttle;

        float da_v3, db_v3, dc_v3;
        foc_v3_fast_tick(&s_foc_v3,
                         raw_ia, raw_ib,
                         garudaData.vbusRaw, throttle_v3,
                         &da_v3, &db_v3, &dc_v3);

        /* Release PWM overrides when entering active modes */
        {
            static bool v3_ovr_released = false;
            if (s_foc_v3.mode >= V3_ALIGN && s_foc_v3.mode <= V3_VF_ASSIST) {
                if (!v3_ovr_released) {
                    HAL_PWM_ReleaseAllOverrides();
                    v3_ovr_released = true;
                }
                HAL_PWM_SetDutyFloat3Phase(da_v3, db_v3, dc_v3);
            } else if (s_foc_v3.mode == V3_FAULT && v3_ovr_released) {
                HAL_PWM_SetDutyFloat3Phase(0.5f, 0.5f, 0.5f);
            } else {
                v3_ovr_released = false;
            }
        }

        /* Map FOC v3 mode to ESC state for main loop compatibility */
        switch (s_foc_v3.mode) {
            case V3_IDLE:         garudaData.state = ESC_IDLE; break;
            case V3_ARMED:        garudaData.state = ESC_ARMED; break;
            case V3_ALIGN:        garudaData.state = ESC_ALIGN; break;
            case V3_OL_RAMP:      garudaData.state = ESC_OL_RAMP; break;
            case V3_CLOSED_LOOP:  garudaData.state = ESC_CLOSED_LOOP; break;
            case V3_VF_ASSIST:    garudaData.state = ESC_OL_RAMP; break;  /* Map to OL for compat */
            case V3_FAULT:        garudaData.state = ESC_FAULT; break;
            default:              garudaData.state = ESC_FAULT; break;
        }

        /* Fault propagation */
        if (s_foc_v3.mode == V3_FAULT) {
            HAL_MC1PWMDisableOutputs();
            if (garudaData.faultCode == FAULT_NONE)
                garudaData.faultCode = s_foc_v3.fault_code ? s_foc_v3.fault_code : FAULT_FOC_INTERNAL;
            garudaData.runCommandActive = false;
            LED2 = 0;
        }

        /* Telemetry update */
        garudaData.focIdMeas   = s_foc_v3.id_meas;
        garudaData.focIqMeas   = s_foc_v3.iq_meas;
        garudaData.focTheta    = s_foc_v3.theta;
        garudaData.focOmega    = s_foc_v3.omega_pll;
        garudaData.focVbus     = s_foc_v3.vbus;
        garudaData.focIa       = v2_counts_to_amps(raw_ia, (uint16_t)s_foc_v3.ia_offset);
        garudaData.focIb       = v2_counts_to_amps(raw_ib, (uint16_t)s_foc_v3.ib_offset);
        garudaData.focThetaObs = s_foc_v3.theta_obs;
        garudaData.focVd       = s_foc_v3.vd;
        garudaData.focVq       = s_foc_v3.vq;
        /* SMO internals → flux telemetry fields (repurposed) */
        garudaData.focFluxAlpha   = s_foc_v3.smo.e2_alpha;
        garudaData.focFluxBeta    = s_foc_v3.smo.e2_beta;
        garudaData.focLambdaEst   = s_foc_v3.omega;  /* LP-filtered speed (speed PI feedback) */
        garudaData.focObsGain     = s_foc_v3.smo.k_base;
        garudaData.focPidDInteg   = s_foc_v3.pid_d.integral;
        garudaData.focPidQInteg   = s_foc_v3.pid_q.integral;
        garudaData.focPidSpdInteg = s_foc_v3.pid_spd.integral;
        /* Derived diagnostics */
        {
            float vd = s_foc_v3.vd, vq = s_foc_v3.vq;
            float vbus = s_foc_v3.vbus;
            float v_mag = sqrtf(vd * vd + vq * vq);
            float v_max = vbus * 0.57735027f;
            garudaData.focModIndex = (v_max > 0.1f) ? (v_mag / v_max) : 0.0f;
            garudaData.focObsConfidence = s_foc_v3.smo.confidence;
        }
        garudaData.focSubState = s_foc_v3.sub_state;
        garudaData.focOffsetIa = (uint16_t)s_foc_v3.ia_offset;
        garudaData.focOffsetIb = (uint16_t)s_foc_v3.ib_offset;

        /* V4 observer diagnostics */
        garudaData.smoResidual    = s_foc_v3.smo.residual;
        garudaData.pllInnovation  = s_foc_v3.pll.innovation_lpf;
        garudaData.pllOmega       = s_foc_v3.pll.omega_est;
        garudaData.omegaOl        = (s_foc_v3.mode == V3_CLOSED_LOOP)
                                  ? s_foc_v3.omega : s_foc_v3.omega_ol;
        garudaData.handoffCtr     = (uint16_t)s_foc_v3.handoff_ctr;
        garudaData.smoObservable  = s_foc_v3.smo.observable ? 1 : 0;

        /* Duty for telemetry */
        {
            float dmax = da_v3;
            if (db_v3 > dmax) dmax = db_v3;
            if (dc_v3 > dmax) dmax = dc_v3;
            garudaData.duty = (uint32_t)(dmax * LOOPTIME_TCY);
        }

#if FEATURE_BURST_SCOPE
        /* Burst scope sample from v3 state */
        {
            SCOPE_SAMPLE_T ss;
            ss.ia    = (int16_t)(garudaData.focIa * 1000.0f);
            ss.ib    = (int16_t)(garudaData.focIb * 1000.0f);
            ss.id    = (int16_t)(s_foc_v3.id_meas * 1000.0f);
            ss.iq    = (int16_t)(s_foc_v3.iq_meas * 1000.0f);
            ss.vd    = (int16_t)(s_foc_v3.vd * 100.0f);
            ss.vq    = (int16_t)(s_foc_v3.vq * 100.0f);
            ss.theta = (int16_t)(s_foc_v3.theta * 10000.0f);
            ss.obs_x1 = (int16_t)(s_foc_v3.smo.e2_alpha * 100000.0f);
            ss.obs_x2 = (int16_t)(s_foc_v3.smo.e2_beta * 100000.0f);
            {
                float omega_clamped = s_foc_v3.omega_pll;
                if (omega_clamped > 32767.0f) omega_clamped = 32767.0f;
                if (omega_clamped < -32768.0f) omega_clamped = -32768.0f;
                ss.omega = (int16_t)(omega_clamped);
            }
            ss.mod_index = (int16_t)(garudaData.focModIndex * 10000.0f);
            ss.flags  = (s_foc_v3.cl_active ? 0x01 : 0x00)
                      | ((garudaData.state == ESC_FAULT) ? 0x02 : 0x00)
                      | (((uint8_t)s_foc_v3.mode & 0x07) << 2);
            ss.state  = (uint8_t)garudaData.state;
            ss.tick_lsb = (uint16_t)(garudaData.systemTick & 0xFFFF);
            Scope_WriteSample(&ss);
        }
#endif
    } /* end FOC v3 scope */
#elif FEATURE_FOC_AN1078
    /* ── AN1078 control path — float port of Microchip reference ──
     * State machine: STOPPED → LOCK → OPEN_LOOP → CLOSED_LOOP
     * Direct port of pmsm.c + smcpos.c.  No PLL, no v2/v3 hybridization.
     */
    {
        uint16_t throttle_an = garudaData.throttle;

        /* Arming logic — mirror v3:
         *   SW1 / GSP-run cmd → main loop sets garudaData.state = ESC_ARMED
         *   We see ESC_ARMED + cal_done + no fault → AN_MotorStart
         *   SW1 / GSP-stop or fault → main loop sets state = ESC_IDLE / ESC_FAULT
         *   We see those → AN_MotorStop
         * Throttle alone NEVER arms.  This matches v3 semantics. */

        /* Hardware fault recovery: if board PCI tripped, force-stop AN1078
         * so PI doesn't wind up against blocked PWM. */
        if (garudaData.faultCode == FAULT_BOARD_PCI &&
            s_foc_an.mode != AN_MODE_STOPPED) {
            AN_MotorStop(&s_foc_an);
        }

        /* Main-loop wants us idle → stop. */
        if ((garudaData.state == ESC_IDLE || garudaData.state == ESC_FAULT) &&
            s_foc_an.mode != AN_MODE_STOPPED) {
            AN_MotorStop(&s_foc_an);
        }

        /* Main-loop pressed SW1 / sent GSP run → state=ESC_ARMED →
         * start when calibration done and no latched board fault. */
        if (garudaData.state == ESC_ARMED &&
            s_foc_an.mode == AN_MODE_STOPPED &&
            s_foc_an.cal_done &&
            garudaData.faultCode != FAULT_BOARD_PCI) {
            AN_MotorStart(&s_foc_an);
        }

        float da_an, db_an, dc_an;
        AN_MotorFastTick(&s_foc_an,
                         raw_ia, raw_ib,
                         garudaData.vbusRaw, throttle_an,
                         &da_an, &db_an, &dc_an);

        /* PWM enable: match V2/V3 pattern (proven on this hardware).
         * Release overrides first, then write duty.  V2/V3's first PWM
         * cycle sees duty register state from prior HAL_MC1PWMDisableOutputs
         * (PWM_PDC*=0, gates LOW), then SetDuty kicks in next cycle. */
        {
            static bool an_ovr_released = false;
            if (s_foc_an.mode >= AN_MODE_LOCK && s_foc_an.mode <= AN_MODE_CLOSED_LOOP) {
                if (!an_ovr_released) {
                    HAL_PWM_ReleaseAllOverrides();
                    an_ovr_released = true;
                }
                HAL_PWM_SetDutyFloat3Phase(da_an, db_an, dc_an);
            } else if (s_foc_an.mode == AN_MODE_FAULT && an_ovr_released) {
                HAL_PWM_SetDutyFloat3Phase(0.5f, 0.5f, 0.5f);
            } else if (s_foc_an.mode == AN_MODE_STOPPED && an_ovr_released) {
                HAL_MC1PWMDisableOutputs();
                an_ovr_released = false;
            } else {
                an_ovr_released = false;
            }
        }

        /* Map AN1078 mode → ESC state.  DO NOT overwrite ESC_FAULT set
         * externally by the hardware PCI ISR — main loop needs to see
         * that fault state so SW1 fault-clear works. */
        if (garudaData.state != ESC_FAULT) {
            switch (s_foc_an.mode) {
                case AN_MODE_STOPPED:     garudaData.state = ESC_IDLE; break;
                case AN_MODE_LOCK:        garudaData.state = ESC_ALIGN; break;
                case AN_MODE_OPEN_LOOP:   garudaData.state = ESC_OL_RAMP; break;
                case AN_MODE_CLOSED_LOOP: garudaData.state = ESC_CLOSED_LOOP; break;
                case AN_MODE_FAULT:       garudaData.state = ESC_FAULT; break;
                default:                  garudaData.state = ESC_FAULT; break;
            }
        }

        /* Fault propagation */
        if (s_foc_an.mode == AN_MODE_FAULT) {
            HAL_MC1PWMDisableOutputs();
            if (garudaData.faultCode == FAULT_NONE)
                garudaData.faultCode = s_foc_an.faultCode
                                     ? s_foc_an.faultCode : FAULT_FOC_INTERNAL;
            garudaData.runCommandActive = false;
            LED2 = 0;
        }

        /* Telemetry — reuse v2/v3 fields */
        garudaData.focIdMeas   = s_foc_an.id_meas;
        garudaData.focIqMeas   = s_foc_an.iq_meas;
        garudaData.focTheta    = s_foc_an.theta_drive;
        garudaData.focOmega    = s_foc_an.smc.OmegaFltred;
        garudaData.focVbus     = s_foc_an.vbus;
        garudaData.focIa       = s_foc_an.ia;
        garudaData.focIb       = s_foc_an.ib;
        garudaData.focThetaObs = s_foc_an.smc.Theta;
        garudaData.focVd       = s_foc_an.vd;
        garudaData.focVq       = s_foc_an.vq;
        garudaData.focFluxAlpha   = s_foc_an.smc.EalphaFinal;
        garudaData.focFluxBeta    = s_foc_an.smc.EbetaFinal;
        garudaData.focLambdaEst   = s_foc_an.thetaError;
        garudaData.focObsGain     = s_foc_an.smc.Kslf;
        garudaData.focPidDInteg   = s_foc_an.pi_d.integrator;
        garudaData.focPidQInteg   = s_foc_an.pi_q.integrator;
        garudaData.focPidSpdInteg = s_foc_an.pi_spd.integrator;

        {
            float v_mag = sqrtf(s_foc_an.vd * s_foc_an.vd
                              + s_foc_an.vq * s_foc_an.vq);
            float v_max = s_foc_an.vbus * 0.57735027f;
            garudaData.focModIndex = (v_max > 0.1f) ? (v_mag / v_max) : 0.0f;

            /* Confidence-like ratio: observed BEMF magnitude vs expected */
            float bemf_mag = sqrtf(s_foc_an.smc.EalphaFinal * s_foc_an.smc.EalphaFinal
                                 + s_foc_an.smc.EbetaFinal  * s_foc_an.smc.EbetaFinal);
            float omega_abs = (s_foc_an.smc.OmegaFltred >= 0)
                            ?  s_foc_an.smc.OmegaFltred : -s_foc_an.smc.OmegaFltred;
            float bemf_exp = AN_MOTOR_LAMBDA * omega_abs;
            float conf = (bemf_exp > 0.01f) ? (bemf_mag / bemf_exp) : 0.0f;
            if (conf > 1.0f) conf = 1.0f;
            garudaData.focObsConfidence = conf;
        }
        garudaData.focSubState = (uint8_t)s_foc_an.mode;
        garudaData.focOffsetIa = (uint16_t)s_foc_an.ia_offset;
        garudaData.focOffsetIb = (uint16_t)s_foc_an.ib_offset;

        /* Duty for telemetry */
        {
            float dmax = da_an;
            if (db_an > dmax) dmax = db_an;
            if (dc_an > dmax) dmax = dc_an;
            garudaData.duty = (uint32_t)(dmax * LOOPTIME_TCY);
        }
    }
#else
    /* ── 6-step state machine ── */
    /* State machine */
    switch (garudaData.state)
    {
        case ESC_IDLE:
#if FEATURE_OC_AUTOZERO
            s_ocZeroAcc = 0;            /* re-calibrate on the next arm */
            s_ocZeroCount = 0;
#endif
            break;
        case ESC_ARMED:
#if FEATURE_OC_AUTOZERO
            /* Bridge is off in ARMED → the bus ADC reads its true rest bias.
             * Average OC_AUTOZERO_SAMPLES (~1.4ms) and latch; ALIGN starts
             * 500ms later, so calibration always completes first.
             * QUIESCENCE GATE (2026-06-10): a quick re-arm with the rotor
             * still spinning down puts regen ripple on the bus — bench showed
             * whole runs with Ibus telemetry (and OC thresholds) offset ~7A
             * from a bias latched mid-spin. Latch only if the sample window
             * is tight; otherwise discard and retry — the rotor stops and a
             * later window passes. The previous bias holds meanwhile. */
            if (s_ocZeroCount < OC_AUTOZERO_SAMPLES)
            {
                uint16_t v = s_ocZeroRaw;
                if (s_ocZeroCount == 0)
                {
                    s_ocZeroAcc = 0;
                    s_ocZeroMin = v;
                    s_ocZeroMax = v;
                }
                if (v < s_ocZeroMin) s_ocZeroMin = v;
                if (v > s_ocZeroMax) s_ocZeroMax = v;
                s_ocZeroAcc += v;
                if (++s_ocZeroCount == OC_AUTOZERO_SAMPLES)
                {
                    if ((uint16_t)(s_ocZeroMax - s_ocZeroMin)
                            <= OC_AUTOZERO_MAX_SPREAD)
                        g_ocBiasAdc =
                            (uint16_t)(s_ocZeroAcc / OC_AUTOZERO_SAMPLES);
                    else
                        s_ocZeroCount = 0;   /* ripple — retry the window */
                }
            }
#endif
            break;

#if FEATURE_SINE_STARTUP
        case ESC_ALIGN:
        case ESC_OL_RAMP:
            if (garudaData.sine.active)
            {
                uint32_t dA, dB, dC;
                STARTUP_SineComputeDuties(&garudaData, &dA, &dB, &dC);
                HAL_PWM_SetDutyCycle3Phase(dA, dB, dC);
            }
            break;

#endif /* FEATURE_SINE_STARTUP — close so ESC_IF_RAMP is handled regardless of sine */

#if FEATURE_IF_STARTUP
        case ESC_IF_RAMP:
            /* I-f current-controlled spin-up. IF_StartupInit pointed AD1CH0/
             * AD2CH0 at the OA1/OA2 current op-amps, so phaseB_val/phaseAC_val
             * hold ia/ib here. The CMP1/CMP2 removal (hal_comparator.c) un-rails
             * the op-amps that defeated the earlier attempts. */
            IF_StartupTick(phaseB_val, phaseAC_val);
            break;
#endif

#if FEATURE_SINE_STARTUP   /* reopen: the MORPH cases below are sine-specific */
        case ESC_MORPH:
        {
            if (garudaData.morph.subPhase == MORPH_CONVERGE)
            {
                /* Sub-phase A: blended duties, all 3 phases driven */
                uint32_t dA, dB, dC;
                STARTUP_MorphComputeDuties(&garudaData, &dA, &dB, &dC);

