bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
                        if (garudaData.integ.shadowFired)
                        {
                            int16_t diff = (int16_t)(garudaData.integ.shadowFireTick
                                                   - adcIsrTick);
                            garudaData.integ.shadowVsActual = diff;

                            {
                                int64_t wide = (int64_t)garudaData.integ.shadowErrorSum + diff;
                                if (wide < INT32_MIN) wide = INT32_MIN;
                                else if (wide > INT32_MAX) wide = INT32_MAX;
                                garudaData.integ.shadowErrorSum = (int32_t)wide;
                            }

                            int16_t absDiff = (diff < 0) ? -diff : diff;
                            garudaData.integ.shadowAbsErrorSum += (uint32_t)absDiff;

                            if (absDiff <= (int16_t)tol)
                                garudaData.integ.shadowHitCount++;
                            else
                                garudaData.integ.shadowMissCount++;
                        }
                        else
                        {
                            garudaData.integ.shadowNoFireCount++;
                            garudaData.integ.shadowMissCount++;
                            garudaData.integ.shadowVsActual = SHADOW_NO_FIRE_SENTINEL;
                        }
                    }
#endif
#if FEATURE_ADC_CMP_ZC
                    /* Snapshot deadlineIsZc BEFORE AdvanceStep clears it (Rule 14) */
                    bool wasZcDeadline = garudaData.timing.deadlineIsZc;
#endif
                    COMMUTATION_AdvanceStep(&garudaData);
                    BEMF_ZC_OnCommutation(&garudaData, adcIsrTick);
                    BEMF_ZC_HandleUndetectableStep(&garudaData, adcIsrTick);

#if FEATURE_ADC_CMP_ZC
                    /* enablePending hook: hand off to hardware ZC at true-ZC
                     * commutation boundary only (Rule 12) */
                    if (garudaData.hwzc.enablePending && wasZcDeadline)
                    {
                        HWZC_Enable(&garudaData);
                        goto cl_duty_control;
                    }
#endif
                }

                /* Timeout watchdog */
                ZC_TIMEOUT_RESULT_T toResult = BEMF_ZC_CheckTimeout(&garudaData, adcIsrTick);
                if (toResult == ZC_TIMEOUT_DESYNC)
                {
                    garudaData.zcDiag.zcDesyncCount++;
#if FEATURE_HW_OVERCURRENT
                    HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
#if FEATURE_DESYNC_RECOVERY
                    if (garudaData.runCommandActive
                        || true   /* AUTO_DISARM=0: stay in the run loop even
                                   * if some earlier path cleared the flag.
                                   * Re-arm here so the recovery exit can
                                   * restart instead of falling to IDLE. */
                       )
                    {
                        garudaData.runCommandActive = true;
                        HAL_MC1PWMDisableOutputs();
                        garudaData.state = ESC_RECOVERY;
                        garudaData.recoveryCounter = RT_DESYNC_COAST_COUNTS;
                        LED2 = 0;
                    }
                    else
                    {
                        HAL_MC1PWMDisableOutputs();
                        garudaData.desyncRestartAttempts = 0;
                        garudaData.state = ESC_IDLE;
                        LED2 = 0;
                    }
#else
                    garudaData.state = ESC_FAULT;
                    garudaData.faultCode = FAULT_DESYNC;
                    HAL_MC1PWMDisableOutputs();
                    LED2 = 0;
#endif
                }
                else if (toResult == ZC_TIMEOUT_FORCE_STEP)
                {
#if FEATURE_BEMF_INTEGRATION
                    garudaData.integ.shadowSkipCount++;
#endif
                    garudaData.zcDiag.zcTimeoutForceCount++;
                    {
                        uint8_t s = garudaData.currentStep;
                        if (garudaData.timing.stepMissCount[s] < 255)
                            garudaData.timing.stepMissCount[s]++;
                    }
                    COMMUTATION_AdvanceStep(&garudaData);
                    BEMF_ZC_OnCommutation(&garudaData, adcIsrTick);
                    BEMF_ZC_HandleUndetectableStep(&garudaData, adcIsrTick);

                    if (garudaData.timing.goodZcCount == 0)
                    {
                        garudaData.timing.zcSynced = false;
                        garudaData.timing.hasPrevZc = false;
                        uint16_t initPeriod = TIMER1_TO_ADC_TICKS(garudaData.rampStepPeriod);
                        if (initPeriod < RT_MIN_ADC_STEP_PERIOD)
                            initPeriod = RT_MIN_ADC_STEP_PERIOD;
                        garudaData.timing.stepPeriod = initPeriod;
                        garudaData.timing.forcedCountdown = initPeriod;
                    }
                }
            }

#if FEATURE_ADC_CMP_ZC
            }
            else
            {
                /* hwzc.enabled=true: software ZC block skipped.
                 * SCCP1 ISR + comparator ISR handle commutation. */

                /* No speed-drop fallback: once HW ZC activates, it stays
                 * active at all speeds. The ADC comparator works fine at low
                 * eRPM (24kHz samples → plenty per step). Only miss-limit
                 * triggers fallback (error condition). This eliminates the
                 * HW→SW transition jerk during normal deceleration. */

                /* Promote zcSynced once HWZC has confirmed good ZCs.
                 * This unlocks pot-mapped duty (CL_IDLE_DUTY floor)
                 * and MAX_DUTY cap instead of RAMP_DUTY_CAP. */
                if (!garudaData.timing.zcSynced
                    && garudaData.hwzc.goodZcCount >= RT_ZC_SYNC_THRESHOLD)
                {
                    garudaData.timing.zcSynced = true;
                    garudaData.desyncRestartAttempts = 0;
#if FEATURE_HW_OVERCURRENT
                    HAL_CMP3_SetThreshold(RT_OC_CMP3_DAC_VAL);
#endif
                }

                /* Plausibility stall check: if stepPeriodHR is at the IIR
                 * floor (motor apparently at max eRPM) but duty is low,
                 * the motor is physically stalled and HWZC is tracking PWM
                 * switching noise. Debounced to avoid false triggers during
                 * brief transients. Gated on zcSynced to skip post-handoff. */
                {
                    static uint16_t hwzcStallCount = 0;
                    if (prevAdcState != ESC_CLOSED_LOOP)
                        hwzcStallCount = 0;

                    if (garudaData.hwzc.stepPeriodHR <= RT_HWZC_MIN_STEP_TICKS
                        && garudaData.duty < HWZC_STALL_DUTY_LIMIT
                        && garudaData.timing.zcSynced)
                    {
                        if (++hwzcStallCount >= HWZC_STALL_DEBOUNCE_TICKS)
                        {
                            garudaData.hwzc.goodZcCount = 0;
                            garudaData.hwzc.dbgLatchDisable = true;
                            HWZC_Disable(&garudaData);
                            hwzcStallCount = 0;
                        }
                    }
                    else
                    {
                        hwzcStallCount = 0;
                    }
                }

                /* No-capture watchdog: independent of the period/duty stall
                 * check above. If hwzc.totalZcCount hasn't moved for N ticks
                 * while zcSynced is set, the motor is physically stalled
                 * (autonomous SCCP1 timer keeps commutating on the last
                 * known period but no real BEMF edges arrive). The standard
                 * BEMF_ZC_CheckTimeout doesn't see this because lastCommTick
                 * is updated by the autonomous timer's HWZC_OnCommutation
                 * call. Force DESYNC → RECOVERY here so the pot-zero idle
                 * path can recover via the regular restart cycle. */
                {
                    static uint32_t lastZcCount = 0;
                    static uint16_t noCapCount = 0;
                    if (prevAdcState != ESC_CLOSED_LOOP) {
                        lastZcCount = garudaData.hwzc.totalZcCount;
                        noCapCount = 0;
                    }
                    if (garudaData.hwzc.enabled && garudaData.timing.zcSynced)
                    {
                        if (garudaData.hwzc.totalZcCount != lastZcCount)
                        {
                            lastZcCount = garudaData.hwzc.totalZcCount;
                            noCapCount = 0;
                        }
                        else if (++noCapCount >= HWZC_NO_CAPTURE_TICKS)
                        {
                            /* Mirror the desync-handler path so the pot-zero
                             * recovery loop kicks in cleanly. */
                            garudaData.zcDiag.zcDesyncCount++;
#if FEATURE_HW_OVERCURRENT
                            HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
                            HAL_MC1PWMDisableOutputs();
                            garudaData.runCommandActive = true;
                            garudaData.state = ESC_RECOVERY;
                            garudaData.recoveryCounter = RT_DESYNC_COAST_COUNTS;
                            LED2 = 0;
                            noCapCount = 0;
                        }
                    }
                    else
                    {
                        noCapCount = 0;
                    }
                }

