bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
#if FEATURE_HWZC_CAPRATE_WATCHDOG
                /* Capture-RATE watchdog — catches the SELF-DEFENDING phantom
                 * the zero-capture check above cannot: a stray accepted noise
                 * fire every few hundred ms resets noCapCount forever while
                 * the PI stays blind (bench 16V pot-0: 1.7s at eRPM frozen
                 * 6.9k, -5.5A bus, rej=100%). Healthy lock = ~1 accept per
                 * commutation; judge the RATIO over windows instead. */
                {
                    static uint32_t rateWinTick = 0;
                    static uint32_t rateWinComm = 0;
                    static uint32_t rateWinCap  = 0;
                    static uint8_t  rateStrikes = 0;
                    if (prevAdcState != ESC_CLOSED_LOOP)
                    {
                        rateWinTick = garudaData.systemTick;
                        rateWinComm = garudaData.hwzc.totalCommCount;
                        rateWinCap  = garudaData.hwzc.totalZcCount;
                        rateStrikes = 0;
                    }
                    if (garudaData.hwzc.enabled && garudaData.timing.zcSynced)
                    {
                        if ((garudaData.systemTick - rateWinTick)
                            >= HWZC_CAPRATE_WINDOW_MS)
                        {
                            uint32_t dComm = garudaData.hwzc.totalCommCount
                                           - rateWinComm;
                            uint32_t dCap  = garudaData.hwzc.totalZcCount
                                           - rateWinCap;
                            rateWinTick = garudaData.systemTick;
                            rateWinComm = garudaData.hwzc.totalCommCount;
                            rateWinCap  = garudaData.hwzc.totalZcCount;
                            if (dComm >= HWZC_CAPRATE_MIN_COMMS
                                && dCap * 100u < dComm * HWZC_CAPRATE_MIN_PCT)
                                rateStrikes++;
                            else
                                rateStrikes = 0;
                            if (rateStrikes >= HWZC_CAPRATE_STRIKES)
                            {
                                /* Mirror the desync-handler path (same as the
                                 * zero-capture watchdog above). */
                                garudaData.zcDiag.zcDesyncCount++;
#if FEATURE_HW_OVERCURRENT
                                HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
                                HAL_MC1PWMDisableOutputs();
                                garudaData.runCommandActive = true;
                                garudaData.state = ESC_RECOVERY;
                                garudaData.recoveryCounter = RT_DESYNC_COAST_COUNTS;
                                LED2 = 0;
                                rateStrikes = 0;
                            }
                        }
                    }
                    else
                    {
                        /* not judging — keep baselines fresh so a sync regain
                         * doesn't evaluate a window spanning the gap */
                        rateWinTick = garudaData.systemTick;
                        rateWinComm = garudaData.hwzc.totalCommCount;
                        rateWinCap  = garudaData.hwzc.totalZcCount;
                        rateStrikes = 0;
                    }
                }
#endif /* FEATURE_HWZC_CAPRATE_WATCHDOG */

#if FEATURE_HWZC_ABS_FLOOR && FEATURE_HWZC_MISTIME_WATCHDOG
                /* Mistimed-lock watchdog - see garuda_config.h block for the
                 * failure signature. Same recovery mirror as the watchdogs
                 * above; the coast lets the rotor re-enter like a gentle
                 * pot-down, which lands in the clean idle every time. */
                {
                    static uint32_t mtWinTick  = 0;
                    static uint32_t mtPrevErpm = 0;
                    static uint8_t  mtStrikes  = 0;
                    if (prevAdcState != ESC_CLOSED_LOOP)
                    {
                        mtWinTick  = garudaData.systemTick;
                        mtPrevErpm = 0;
                        mtStrikes  = 0;
                    }
                    if (garudaData.hwzc.enabled && garudaData.timing.zcSynced
                        && (garudaData.systemTick - mtWinTick)
                           >= HWZC_CAPRATE_WINDOW_MS)
                    {
                        mtWinTick = garudaData.systemTick;
                        uint32_t p = garudaData.hwzc.stepPeriodHR;
                        uint32_t erpm = (p > 0u) ? (1000000000UL / p) : 0u;
                        float dutyFrac = (float)garudaData.duty
                                       / (float)LOOPTIME_TCY;
                        float vbus_v = (float)garudaData.vbusRaw
                                     * VBUS_SCALE_V_PER_COUNT;
                        float lam = (float)gspParams.focKeUvSRad;
                        uint8_t strike = 0;
                        if (erpm > 0u && lam > 0.0f && vbus_v > 6.0f
                            && dutyFrac > HWZC_ABS_FLOOR_MIN_DUTYFRAC
                            && dutyFrac < HWZC_ABS_FLOOR_LOW_DUTYFRAC)
                        {
                            float erpmFf = (vbus_v * dutyFrac)
                                * (1.0e9f / (181.380f * lam));
                            float ceilE = erpmFf
                                * ((float)(HWZC_ABS_FLOOR_OVERSPEED_PCT_LOW
                                           + HWZC_MISTIME_MARGIN_PCT) / 100.0f);
                            uint8_t falling = (mtPrevErpm > 0u)
                                && (erpm * 100u < mtPrevErpm
                                    * (100u - HWZC_MISTIME_DECEL_EXCL_PCT));
                            if ((float)erpm > ceilE && !falling)
                                strike = 1;
                        }
                        mtPrevErpm = erpm;
                        if (strike) { mtStrikes++; gspParams.dbgMistimeEvents++; }
                        else mtStrikes = 0;
                        if (mtStrikes >= HWZC_MISTIME_STRIKES)
                        {
                            garudaData.zcDiag.zcDesyncCount++;
#if FEATURE_HW_OVERCURRENT
                            HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
                            HAL_MC1PWMDisableOutputs();
                            garudaData.runCommandActive = true;
                            garudaData.state = ESC_RECOVERY;
                            garudaData.recoveryCounter = RT_DESYNC_COAST_COUNTS;
                            LED2 = 0;
                            mtStrikes = 0;
                            gspParams.dbgMistimeEvents += 100; /* trip marker */
                        }
                    }
                }
#endif /* FEATURE_HWZC_MISTIME_WATCHDOG */

#if FEATURE_BEMF_INTEGRATION
                /* Read-only observer: keep shadow integration warm (Rule 11) */
                {
                    bool newComm = (garudaData.hwzc.commSeq
                                    != garudaData.hwzc.obsCommSeq);
                    if (newComm)
                    {
                        garudaData.hwzc.obsCommSeq =
                            garudaData.hwzc.commSeq;
                        garudaData.hwzc.obsLastCommTick = adcIsrTick;
                        /* Seqlock read of stepPeriodHR (Rule 13) */
                        uint32_t sp;
                        uint16_t s1, s2;
                        do {
                            s1 = garudaData.hwzc.writeSeq;
                            sp = garudaData.hwzc.stepPeriodHR;
                            s2 = garudaData.hwzc.writeSeq;
                        } while (s1 != s2 || (s1 & 1));
                        uint16_t obsPeriod = HWZC_SCCP2_TO_ADC(sp);
                        if (obsPeriod < 1) obsPeriod = 1;
                        BEMF_INTEG_ObserverOnComm(&garudaData, obsPeriod);
                        garudaData.hwzc.shadowHwzcSkipCount++;
                    }
                    BEMF_INTEG_ObserverTick(&garudaData, adcIsrTick,
                        garudaData.hwzc.obsLastCommTick);
                }
#endif /* FEATURE_BEMF_INTEGRATION */
            }
#endif /* FEATURE_ADC_CMP_ZC */

#if FEATURE_ADC_CMP_ZC
        cl_duty_control:
#endif

            /* Duty cycle control. */
            {
                uint32_t cap = garudaData.timing.zcSynced ? MAX_DUTY : RT_RAMP_DUTY_CAP;
                uint32_t mappedDuty;

#if FEATURE_DUTY_SLEW
                static uint16_t postSyncCounter = 0;
#endif

                if (!garudaData.timing.zcSynced)
                {
                    /* Pre-sync: hold duty at CL entry level.
                     * Don't let pot changes affect duty while forced
                     * commutation is trying to lock ZC — changing duty
                     * shifts the threshold and confuses detection. */
                    mappedDuty = garudaData.duty;
#if FEATURE_DUTY_SLEW
                    postSyncCounter = 0;
#endif
                }
                else
                {
#if FEATURE_DUTY_SLEW
                    if (postSyncCounter < RT_POST_SYNC_SETTLE_TICKS)
                        postSyncCounter++;
#endif
#if FEATURE_SPEED_CASCADE
                    /* WS4 cascade (gate+seed+slew): the loop ENGAGES only above
                     * the engage gate; below it the normal throttle→duty map
                     * (fallbackDuty) drives startup + the sync-fragile accel
                     * untouched. Force disengaged on CL entry; the loop re-engages
                     * itself, bumpless, once eRPM climbs into the stable band.
                     * Downstream OC soft-limit / VBUS-sag clamps remain below. */
                    {
                        uint32_t fallbackDuty = RT_CL_IDLE_DUTY +
                            ((uint32_t)garudaData.throttle * (cap - RT_CL_IDLE_DUTY)) / 4096;
                        if (fallbackDuty < MIN_DUTY) fallbackDuty = MIN_DUTY;
                        if (fallbackDuty > cap)      fallbackDuty = cap;
                        if (prevAdcState != ESC_CLOSED_LOOP)
                            SPEED_CASCADE_Reset();
                        mappedDuty = SPEED_CASCADE_InnerStep(&garudaData, cap, fallbackDuty);
                    }
#elif FEATURE_SPEED_PI
                    /* Speed PI: throttle controls TARGET SPEED via target
                     * stepPeriodHR; PI regulates duty to track. Replaces
                     * the direct throttle→duty scaling below. The output
                     * is updated per HWZC event (see SPEED_PI_OnZcEvent).
                     *
                     * SPEED_PI_Enable on first sync tick — bumpless transfer
                     * (integrator seeded from garudaData.duty). */
                    if (!garudaData.speedPi.enabled)
                        SPEED_PI_Enable(&garudaData);
                    mappedDuty = garudaData.speedPi.outputDuty;
#else
#if FEATURE_CL_DIFF_IDLE
                    /* Differential-low idle: throttle maps from the (sub-
                     * MIN_DUTY) diff floor — idle equilibrium ~3k, meeting the
                     * morph hand-off speed instead of slamming up to ~10k. */
                    mappedDuty = CL_DIFF_IDLE_FLOOR +
                        ((uint32_t)garudaData.throttle * (cap - CL_DIFF_IDLE_FLOOR)) / 4096;
#else
                    mappedDuty = RT_CL_IDLE_DUTY +
                        ((uint32_t)garudaData.throttle * (cap - RT_CL_IDLE_DUTY)) / 4096;
#endif
#endif
                }
#if FEATURE_CL_DIFF_IDLE
                if (mappedDuty < CL_DIFF_IDLE_FLOOR) mappedDuty = CL_DIFF_IDLE_FLOOR;
#elif FEATURE_CL_LOW_IDLE
                /* Lower CL idle floor (deadtime unchanged → no shoot-through risk;
                 * only shortens the H-pulse). Drops idle equilibrium + handoff gap. */
                if (mappedDuty < CL_LOW_IDLE_FLOOR) mappedDuty = CL_LOW_IDLE_FLOOR;
#else
                if (mappedDuty < MIN_DUTY) mappedDuty = MIN_DUTY;
#endif
                if (mappedDuty > cap) mappedDuty = cap;


#if FEATURE_DUTY_SLEW
                {
                    static uint32_t prevDuty = 0;
                    if (prevAdcState != ESC_CLOSED_LOOP)
                        prevDuty = garudaData.duty;

                    /* Post-sync settle: use reduced slew-up rate for
                     * POST_SYNC_SETTLE_MS after ZC lock. This prevents
                     * the motor from accelerating faster than the
                     * stepPeriod IIR can track on low-inertia motors.
                     * Normal rate: 2%/ms. Settle rate: 0.25%/ms (1/8). */
                    uint32_t upRate = RT_DUTY_SLEW_UP_RATE;
                    if (postSyncCounter < RT_POST_SYNC_SETTLE_TICKS)
                        upRate = RT_DUTY_SLEW_UP_RATE / RT_POST_SYNC_SLEW_DIVISOR;


                    int32_t delta = (int32_t)mappedDuty - (int32_t)prevDuty;
                    if (delta > 0)
                    {
                        if ((uint32_t)delta > upRate)
                            mappedDuty = prevDuty + upRate;
                    }
                    else if (delta < 0)
                    {
#if FEATURE_VBUS_REGEN_BRAKE
                        /* Vbus-aware regen brake — sticky version. Once engaged
                         * (Vbus rose above ON threshold during a regen event),
                         * stays engaged for minimum hold ticks even if Vbus
                         * briefly dips, then releases only when Vbus falls all
                         * the way to OFF threshold (wide hysteresis). This
                         * prevents the chatter that let duty keep dropping
                         * across regen pulses in the prior implementation. */
                        static bool regenBrakeActive = false;
                        static uint16_t regenBrakeHoldTicks = 0;
                        if (regenBrakeActive) {
                            if (regenBrakeHoldTicks > 0)
                                regenBrakeHoldTicks--;
                            if (regenBrakeHoldTicks == 0
                                && garudaData.vbusRaw < VBUS_REGEN_BRAKE_OFF_ADC)
                                regenBrakeActive = false;
                        } else {
                            if (garudaData.vbusRaw > VBUS_REGEN_BRAKE_ON_ADC) {
                                regenBrakeActive = true;
                                regenBrakeHoldTicks = VBUS_REGEN_BRAKE_MIN_TICKS;
                            }
                        }
                        uint32_t effectiveDownRate = RT_DUTY_SLEW_DOWN_RATE;
                        if (regenBrakeActive) {
                            /* Slow the slew-down rather than freezing entirely.
                             * Motor still decelerates during regen but at a rate
                             * the bus capacitor can absorb. Avoids the clumsy
                             * "can't decelerate" feel of a hard freeze. */
                            effectiveDownRate = RT_DUTY_SLEW_DOWN_RATE
                                              / VBUS_REGEN_BRAKE_SLEW_DIVISOR;
                            if (effectiveDownRate == 0) effectiveDownRate = 1;
                        }
#if FEATURE_HIGH_RPM_SLEW_DOWN
                        /* Proactive: at high eRPM, slew-down is limited
                         * regardless of Vbus state. Prevents the regen
                         * pulse before it spikes the bus. Reads HWZC's
                         * stepPeriodHR — at high RPM HWZC owns the period.
                         * Below the threshold or before HWZC engages,
                         * no penalty applied. */
                        if (garudaData.hwzc.enabled
                            && garudaData.hwzc.stepPeriodHR > 0
                            && garudaData.hwzc.stepPeriodHR
                               < HIGH_RPM_SLEW_THRESHOLD_HR) {
                            uint32_t highRpmRate = RT_DUTY_SLEW_DOWN_RATE
                                                 / HIGH_RPM_SLEW_DIVISOR;
                            if (highRpmRate == 0) highRpmRate = 1;
                            if (effectiveDownRate > highRpmRate)
                                effectiveDownRate = highRpmRate;
                        }
#endif
#if FEATURE_VBUS_EMERGENCY_HOLD
                        /* Emergency tier: above regen brake (28V), if
                         * Vbus hits 30V, FREEZE slew-down entirely so
                         * the rotor stops dumping regen energy into bus.
                         * Sticky hysteresis (30→27V) + 20ms min hold
                         * to prevent chatter. Releases when Vbus settles
                         * back below 27V AND min-hold has elapsed. */
                        static bool emergencyHoldActive = false;
                        static uint16_t emergencyHoldTicks = 0;
                        if (emergencyHoldActive) {
                            if (emergencyHoldTicks > 0)
                                emergencyHoldTicks--;
                            if (emergencyHoldTicks == 0
                                && garudaData.vbusRaw < VBUS_EMERGENCY_HOLD_OFF_ADC)
                                emergencyHoldActive = false;
                        } else {
                            if (garudaData.vbusRaw > VBUS_EMERGENCY_HOLD_ON_ADC) {
                                emergencyHoldActive = true;
                                emergencyHoldTicks = VBUS_EMERGENCY_HOLD_MIN_TICKS;
                            }
                        }
                        if (emergencyHoldActive)
                            effectiveDownRate = 0;
#endif
                        if ((uint32_t)(-delta) > effectiveDownRate)
                            mappedDuty = prevDuty - effectiveDownRate;
#else
                        if ((uint32_t)(-delta) > RT_DUTY_SLEW_DOWN_RATE)
                            mappedDuty = prevDuty - RT_DUTY_SLEW_DOWN_RATE;
#endif
                    }
                    prevDuty = mappedDuty;
                }
#endif

