bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
#if FEATURE_SPINDOWN_FLOOR
                /* Spin-down BEMF floor — clamp the commanded duty to no more
                 * than SPINDOWN_FLOOR_MARGIN below the BEMF-equivalent duty of
                 * the MEASURED speed, so a pot-0 from cruise glides down with
                 * captures alive instead of diode-clamping the floating phase
                 * (rej=100%, tracker coasts, phantom-locks — bench 20V run
                 * 2026-07-03). Floor falls as the rotor slows, reaching the
                 * idle floor naturally; inactive once equiv duty - margin
                 * drops below the throttle command. Placed BEFORE sag/OC
                 * limiters so protections still cut below it. */
                {
                    /* Perf (2026-07-04 audit): the model math costs 3-4 u32
                     * divisions; floor dynamics are mechanical (ms-scale), so
                     * recompute every 8th tick (~178us) and apply the CACHED
                     * floor every tick. Clamp behavior identical. */
                    static uint32_t floorDutyCache = 0;
                    static uint8_t  floorPhase = 0;
                    if (prevAdcState != ESC_CLOSED_LOOP)
                    {
                        floorDutyCache = 0;
                        floorPhase = 0;
                    }
                    if (garudaData.hwzc.enabled && garudaData.timing.zcSynced
                        && garudaData.hwzc.stepPeriodHR > 0)
                    {
                        if ((++floorPhase & 7u) == 0u)
                        {
                            /* eRPM = 1e9 / stepPeriodHR (60deg step, 10ns HR ticks) */
                            uint32_t erpm = 1000000000UL / garudaData.hwzc.stepPeriodHR;
                            uint32_t vraw = garudaData.vbusRaw;
                            if (vraw < 100u) vraw = 100u;   /* div guard (UV faults first) */
                            /* Timing-advance droop: the flat KV_NUM overestimates equiv
                             * duty at speed (field weakening) - enough to LATCH full
                             * duty at pot 0 (bench 2026-07-03, 81k@98%). See config. */
                            uint32_t kvNum = (uint32_t)SPINDOWN_FLOOR_KV_NUM;
                            uint32_t kvDroop = erpm / (uint32_t)SPINDOWN_FLOOR_KV_DROOP_ERPM;
                            kvNum = (kvDroop + (uint32_t)SPINDOWN_FLOOR_KV_MIN >= kvNum)
                                    ? (uint32_t)SPINDOWN_FLOOR_KV_MIN : (kvNum - kvDroop);
                            uint32_t equivPctX100 = erpm * kvNum / vraw;
                            uint32_t marginPctX100 = (uint32_t)SPINDOWN_FLOOR_MARGIN_PCT_X10 * 10u;
                            if (equivPctX100 > marginPctX100)
                            {
                                uint32_t floorPctX100 = equivPctX100 - marginPctX100;
                                /* hard cap: the floor must never reach the sustaining-
                                 * duty region - the pot must ALWAYS retain authority */
                                if (floorPctX100 > (uint32_t)SPINDOWN_FLOOR_MAX_PCT_X100)
                                    floorPctX100 = (uint32_t)SPINDOWN_FLOOR_MAX_PCT_X100;
                                floorDutyCache = (uint32_t)LOOPTIME_TCY * floorPctX100 / 10000u;
                            }
                            else
                                floorDutyCache = 0;
                        }
                        if (mappedDuty < floorDutyCache)
                            mappedDuty = floorDutyCache;
                    }
                    else
                        floorDutyCache = 0;
                }
#endif
                if (garudaData.timing.stepPeriod <= RT_MIN_CL_ADC_STEP_PERIOD
                    && mappedDuty > garudaData.duty)
                {
                    mappedDuty = garudaData.duty;
                }

#if FEATURE_VBUS_SAG_LIMIT
                {
                    static uint16_t vbusFiltered = 0;
                    static bool vbusSagActive = false;

                    if (prevAdcState != ESC_CLOSED_LOOP)
                    {
                        vbusFiltered = garudaData.vbusRaw;
                        vbusSagActive = false;
                    }

                    /* IIR filter always runs (keeps filter warm during pre-sync) */
                    vbusFiltered = (uint16_t)(
                        ((uint32_t)vbusFiltered * 7 + garudaData.vbusRaw) >> 3);

                    if (!vbusSagActive && vbusFiltered < VBUS_SAG_THRESHOLD_ADC)
                        vbusSagActive = true;
                    else if (vbusSagActive && vbusFiltered > VBUS_SAG_RECOVERY_ADC)
                        vbusSagActive = false;

                    if (vbusSagActive)
                    {
                        uint32_t sagDepth = (vbusFiltered < VBUS_SAG_THRESHOLD_ADC) ?
                            (VBUS_SAG_THRESHOLD_ADC - vbusFiltered) : 0;
                        uint32_t reduction = (sagDepth * VBUS_SAG_GAIN) >> 4;
                        if (reduction >= mappedDuty)
                            mappedDuty = MIN_DUTY;
                        else
                            mappedDuty -= reduction;
                    }

#if FEATURE_CL_LOW_IDLE
                    /* respect the lowered CL idle floor (this sag block's
                     * re-floor would otherwise clobber CL_LOW_IDLE_FLOOR
                     * back up to MIN_DUTY every tick) */
                    if (mappedDuty < CL_LOW_IDLE_FLOOR)
                        mappedDuty = CL_LOW_IDLE_FLOOR;
#elif FEATURE_CL_DIFF_IDLE
                    /* differential-low idle: don't re-floor up to MIN_DUTY */
                    if (mappedDuty < CL_DIFF_IDLE_FLOOR)
                        mappedDuty = CL_DIFF_IDLE_FLOOR;
#else
                    if (mappedDuty < MIN_DUTY)
                        mappedDuty = MIN_DUTY;
#endif
                }
#endif

#if FEATURE_HW_OVERCURRENT
                /* Software bus current soft limiter — proportional duty reduction.
                 * Ramps down duty smoothly BEFORE CMP3/CLPCI hardware trips. */
                if (garudaData.ibusRaw > OC_SW_LIMIT_ADC
                    && mappedDuty > MIN_DUTY)   /* guard: below MIN_DUTY (diff idle)
                                                 * the subtraction would underflow
                                                 * unsigned and RAISE duty under OC */
                {
                    uint16_t excess = garudaData.ibusRaw - OC_SW_LIMIT_ADC;
                    uint16_t range = RT_OC_CMP3_DAC_VAL - OC_SW_LIMIT_ADC;
                    if (range == 0) range = 1;
                    uint32_t reduction = ((uint32_t)excess * (mappedDuty - MIN_DUTY)) / range;
                    if (reduction >= mappedDuty - MIN_DUTY)
                        mappedDuty = MIN_DUTY;
                    else
                        mappedDuty -= reduction;
                    /* Chopped cycles corrupt the BEMF window - blank HW-ZC
                     * captures for this + next cycle (scope run 18: the chop
                     * at the correctly-scaled 18A caused the same chop->
                     * BEMF-dead->slip->phantom chain as the mis-scaled 6A). */
                    garudaData.hwzc.chopBlank = 2;
                }
                else if (garudaData.hwzc.chopBlank)
                    garudaData.hwzc.chopBlank--;
#endif

#if FEATURE_CL_SOFT_ENTRY
                /* Option A — soft OL->CL hand-off. MORPH leaves the duty already
                 * at operating level (~6%), so a slew-RATE limiter has no upward
                 * step to catch. Instead OWN an explicit cap that starts at
                 * MIN_DUTY on CL entry and ramps up gently, so the motor walks
                 * from the low-BEMF hand-off speed (~3k) to the idle equilibrium
                 * (~14k) with bounded current instead of the ~22A torque slam.
                 * Final cap (after OC limiter) so protections still win; only
                 * limits the UPPER bound during the entry window. */
                {
                    static uint32_t softCap = 0;
                    static uint16_t softCtr = 0;
                    if (prevAdcState != ESC_CLOSED_LOOP) {
                        softCtr  = 0;
                        softCap  = MIN_DUTY;        /* begin LOW, ignore morph-exit duty */
                    }
                    if (softCtr < CL_SOFT_ENTRY_TICKS) {
                        softCtr++;
                        uint32_t step = RT_DUTY_SLEW_UP_RATE / CL_SOFT_ENTRY_DIVISOR;
                        if (step == 0) step = 1;
                        softCap += step;
                        if (mappedDuty > softCap)
                            mappedDuty = softCap;
                    }
                }
#endif

#if FEATURE_CL_ENTRY_GLIDE
                /* Entry glide: ramp effective duty linearly from the matched
                 * engage level to MIN_DUTY (~320ms), overriding the mapping
                 * (placed LAST so the MIN_DUTY floors above can't undo the
                 * sub-MIN cap). Speed follows quasi-statically → near-linear
                 * climb to the MIN_DUTY equilibrium at a few amps instead of
                 * the ballistic 22A slam. At MIN_DUTY, force-swap to the
                 * conventional waveform — bit-identical baseline after. */
                if (s_glideActive)
                {
                    if (++s_glideDivCtr >= CL_GLIDE_DIV)
                    {
                        s_glideDivCtr = 0;
                        s_glideDuty++;
                    }
                    if (s_glideDuty >= MIN_DUTY)
                    {
                        s_glideActive = 0;
                        if (g_pwmDiffLow)
                        {
                            /* hand back to the baseline waveform (HWZC then
                             * re-enables via the normal crossover logic) */
                            g_pwmDiffLow = 0;
                            HAL_PWM_SetCommutationStep(garudaData.currentStep);
                        }
                    }
                    else if (mappedDuty > s_glideDuty)
                    {
                        mappedDuty = s_glideDuty;
                    }
                }
#endif

#if FEATURE_HWZC_CAP_DUTY_HOLD
                /* Anti cap-slam (HWZC-period twin of the SW-period guard above).
                 * When eRPM is pinned within ~(1/2^SHIFT) of the maxClosedLoopErpm
                 * clamp — i.e. stepPeriodHR at/near the period floor — the rotor
                 * can't commutate faster, so any further duty rise just over-drives
                 * the held speed (rotor outruns commutation -> rej->0 -> 22A ->
                 * BOARD_PCI). Hold duty at its current value while pinned so the
                 * motor settles at the cap at the duty that reached it. Only ever
                 * HOLDS/LOWERS duty (mappedDuty can still fall on throttle-down) —
                 * one-directional safe, no λ calibration. */
                if (garudaData.hwzc.enabled
                    && garudaData.hwzc.stepPeriodHR > 0
                    && garudaData.hwzc.stepPeriodHR
                       <= (RT_HWZC_MIN_STEP_TICKS
                           + (RT_HWZC_MIN_STEP_TICKS >> CAP_DUTY_HOLD_MARGIN_SHIFT)))
                {
                    /* Hard ceiling first: near the cap, duty must not exceed the
                     * BEMF-match equilibrium (empirically ~86% @24V on the 2810),
                     * else the rotor outruns the commutation clamp -> 22A ->
                     * BOARD_PCI. A FAST throttle ramp can cross into the band
                     * already at 89-97% duty, which freeze-at-previous alone can't
                     * undo (it latches the too-high entry value) — this caps it. */
                    uint32_t capHoldMax =
                        (uint32_t)(((uint32_t)CAP_DUTY_HOLD_MAX_PCT * (uint32_t)LOOPTIME_TCY) / 100u);
                    if (capHoldMax < MIN_DUTY) capHoldMax = MIN_DUTY;
                    if (mappedDuty > capHoldMax) mappedDuty = capHoldMax;
                    /* Then freeze: don't let duty climb further while pinned. */
                    if (mappedDuty > garudaData.duty) mappedDuty = garudaData.duty;
                }
#endif

