bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
                garudaData.duty = mappedDuty;

#if FEATURE_CL_DIFF_IDLE
                /* Drive-mode management. garudaData.duty is EFFECTIVE duty in
                 * both modes (identical line-line volts for duty ≥ MIN_DUTY),
                 * so the swaps are voltage-seamless; only the low phase's
                 * waveform class changes. Hysteresis prevents IOCON churn. */
                {
                    /* (CL entry is handled by the coast-listen block at the
                     * top of the case — it engages diff mode synced.) */
                    if (g_pwmDiffLow
                             && garudaData.duty >= MIN_DUTY
                                + (MIN_DUTY / CL_DIFF_EXIT_HYST_DIV))
                    {
                        /* throttle demand exceeds the conventional floor —
                         * swap to the proven override-LOW waveform (HWZC
                         * re-enables via the normal crossover logic) */
                        g_pwmDiffLow = 0;
                        HAL_PWM_SetCommutationStep(garudaData.currentStep);
                    }
                    else if (!g_pwmDiffLow && garudaData.duty < MIN_DUTY)
                    {
                        /* demand back below the conventional floor — re-enter */
                        g_pwmDiffLow = 1;
                        HAL_PWM_SetCommutationStep(garudaData.currentStep);
#if FEATURE_ADC_CMP_ZC
                        garudaData.hwzc.enablePending = false;
                        if (garudaData.hwzc.enabled)
                        {
                            /* hand ZC back to the SW valley detector, re-seeded
                             * from HWZC's period (the proven fallback path) */
                            HWZC_Disable(&garudaData);
                            garudaData.hwzc.fallbackPending = true;
                        }
#endif
                    }
                }
#endif

            }
            HAL_PWM_SetDutyCycle(garudaData.duty);
            break;
        }
#else  /* !FEATURE_BEMF_CLOSED_LOOP — Phase 1 open-loop path */
        case ESC_CLOSED_LOOP:
            HAL_PWM_SetDutyCycle(garudaData.duty);
            break;
#endif

        case ESC_BRAKING:
            break;

        case ESC_RECOVERY:
            /* PWM already disabled on entry — coast-down handled in Timer1 */
            break;

        case ESC_FAULT:
            HAL_MC1PWMDisableOutputs();
            break;
    }
#endif /* !FEATURE_FOC && !FEATURE_FOC_V2 && !FEATURE_FOC_V3 && !FEATURE_FOC_AN1078 — end of 6-step state machine */

#if FEATURE_BEMF_CLOSED_LOOP
    /* Track state for transition detection (must be last before flag clear).
     * Use entryState (not garudaData.state) so mid-ISR state changes
     * (e.g. morph→CL) are visible on the NEXT tick. */
#if FEATURE_SPEED_PI
    /* Disable speed PI when leaving CL state. Cleanup so SPEED_PI_OnZcEvent
     * (called from HWZC ISR) no-ops until next CL re-entry. Bumpless on
     * re-enable because Enable seeds integrator from current duty. */
    if (entryState == ESC_CLOSED_LOOP
        && garudaData.state != ESC_CLOSED_LOOP
        && garudaData.speedPi.enabled)
        SPEED_PI_Disable(&garudaData);
#endif
    prevAdcState = entryState;
#endif

    /* X2CScope: sample variables at ADC rate (24kHz) */
#ifdef ENABLE_DIAGNOSTICS
    DiagnosticsStepIsr();
#endif

    /* Clear interrupt flag AFTER reading all buffers (matches reference) */
    GARUDA_ClearADCIF();
}

/**
 * @brief Timer1 ISR — 100us tick.
 * Handles: heartbeat LED, board service, commutation timing for
 * align/ramp states, 1ms system tick.
 */
void __attribute__((__interrupt__, no_auto_psv)) _T1Interrupt(void)
{
    /* Heartbeat LED — toggle at ~2Hz (250ms) */
    heartbeatCounter++;
    if (heartbeatCounter >= HEART_BEAT_LED_COUNT)
    {
        heartbeatCounter = 0;
        if (LED1 == 1)
            LED1 = 0;
        else
            LED1 = 1;
    }

    /* Board service step (drives button debounce at 1ms) */
    BoardServiceStepIsr();

    /* 1ms system tick sub-counter (10 x 100us = 1ms) */
    msSubCounter++;
    if (msSubCounter >= 10)
    {
        msSubCounter = 0;
        garudaData.systemTick++;
    }

    /* State-specific processing at 100us rate */
    switch (garudaData.state)
    {
        case ESC_IDLE:
            /* Nothing — waiting for button press in main loop */
            break;

        case ESC_ARMED:
#if FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3 || FEATURE_FOC_AN1078
            /* FOC: arming handled in ADC ISR slow loop (1kHz) to avoid
             * cross-ISR races. Timer1 is a no-op for ESC_ARMED with FOC. */
            break;
#else
            /* Arm window + launch gate. The pot must sit near zero for ARM_TIME
             * (the safety gate). With FEATURE_POT_START_STOP the motor then HOLDS
             * armed-and-off until the pot is raised past THROTTLE_START_ADC;
             * without it, the motor auto-starts when the arm window completes. */
            {
                bool armReady =
                    (garudaData.armCounter >= ARM_TIME_COUNTS);
                bool launchNow = false;

                if (garudaData.throttle < ARM_THROTTLE_ZERO_ADC)
                {
                    garudaData.armCounter++;
#if !FEATURE_POT_START_STOP
                    if (armReady) launchNow = true;   /* auto-start once armed */
#endif
                    /* POT_START_STOP: stay ARMED & ready (motor off); the launch
                     * fires below on a pot-raise. */
                }
#if FEATURE_POT_START_STOP
                else if (armReady && garudaData.throttle >= THROTTLE_START_ADC)
                {
                    launchNow = true;   /* armed + pot raised past start → launch */
                }
                /* else: armed but pot between zero and start — hold ARMED, motor
                 * off, keep the arm latch (don't reset armCounter). */
#else
                else
                {
                    garudaData.armCounter = 0; /* not armed — reset if pot not zero */
                }
#endif

