bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
                if (launchNow)
                {
                    /* Armed successfully — transition to ALIGN.
                     * Init before state change: ADC ISR (prio 6) can
                     * preempt Timer1 (prio 5) between the two lines. */
                    STARTUP_Init(&garudaData);
#if FEATURE_IBUS_PROBE
                    /* Bus-current chop probe: keep the sine align ACTIVE (the
                     * proven bridge drive — STARTUP_Init already set sine.active
                     * + released overrides). Hold it in ESC_ALIGN (don't advance)
                     * and sweep the CMP3 chop threshold there. The earlier
                     * SetCommutationStep path never energized the bridge from
                     * this entry → zero current; the sine drive does. */
                    garudaData.state = ESC_ALIGN;
#elif FEATURE_IF_STARTUP
                    /* I-f self-aligns from the clean override-low bridge state.
                     * STARTUP_Init's SineInit briefly wrote sine duties + released
                     * overrides; IF_StartupInit (same tick) overwrites to balanced
                     * 0V before any sine duty latches, so the sine HOLD never runs
                     * and there's no sine→SVPWM handover. */
                    IF_StartupInit();
                    garudaData.state = ESC_IF_RAMP;
#else
                    garudaData.state = ESC_ALIGN;
#endif
                    LED2 = 1; /* Motor running indicator */
                }   /* if (launchNow) */
            }   /* arm window + launch gate block */
            break;
#endif

        case ESC_ALIGN:
#if FEATURE_IBUS_PROBE
            /* Hold the PROVEN sine align (ignore its completion return so the
             * bridge keeps driving real current ~1.5A), and sweep the CMP3 chop
             * threshold over a FINE 0..3A range (the align current is small).
             * As the pot rises the threshold drops; when it crosses the real
             * current the chop fires → eRPM (trip-rate, hijacked) JUMPS and Ibus
             * DROPS toward the threshold. Trip current: A ≈ 3 × (4095 − thr)/4095.
             * eRPM lighting + Ibus falling = the hardware current chop WORKS. */
            (void)STARTUP_SineAlign(&garudaData);
            PG1LEBbits.LEB = 80u;
            /* INPSEL SCAN (2026-06-13): force DAC3 to 30 (below the OA3 ~78 rest)
             * so the comparator + input should read HIGH on whichever input the
             * op-amp actually lands on. SWEEP THE POT through 5 zones; eRPM
             * (= live CMPSTAT, 10000/0) lights in the zone whose input sees OA3:
             *   pot 0-20%   INPSEL=0  CMP_A = RA5 = OA3OUT   (expected winner)
             *   pot 20-40%  INPSEL=1  CMP_B = RB5 = OA3IN+
             *   pot 40-60%  INPSEL=2  CMP_C = RA6 = OA3IN-
             *   pot 60-80%  INPSEL=3  CMP_D = RA1            (AN957's value)
             *   pot 80-100% INPSEL=4  Bandgap 0.8V — CHAIN SELF-TEST: this MUST
             *               read 10000 (993 > 30). If even THIS stays 0, the
             *               comparator/DAC/CMPSTAT chain is broken, not the input. */
            {
                uint16_t z = garudaData.throttle;
                uint8_t  sel = (z < 819u) ? 0u : (z < 1638u) ? 1u
                             : (z < 2457u) ? 2u : (z < 3276u) ? 3u : 4u;
                DAC3CMPbits.INPSEL = sel;
                DAC3DATbits.DACDAT = 30u;
            }
            break;
#elif FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3 || FEATURE_FOC_AN1078
            /* FOC: alignment handled in ADC ISR. Timer1 is a no-op. */
            break;
#elif FEATURE_SINE_STARTUP
            /* I-f path bypasses ALIGN entirely (ARMED→IF_RAMP), so this only
             * runs in the non-IF build. */
            if (STARTUP_SineAlign(&garudaData))
            {
                garudaData.state = ESC_OL_RAMP;
            }
            break;
#else
            if (STARTUP_Align(&garudaData))
            {
                garudaData.state = ESC_OL_RAMP;
                garudaData.rampCounter = garudaData.rampStepPeriod;
            }
            break;
#endif

#if FEATURE_IF_STARTUP
        case ESC_IF_RAMP:
            /* I-f spin-up is driven entirely in the ADC ISR; Timer1 is a no-op. */
            break;
#endif

        case ESC_OL_RAMP:
#if FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3 || FEATURE_FOC_AN1078
            /* FOC: I/f ramp handled in ADC ISR. Timer1 is a no-op. */
            break;
#elif DIAGNOSTIC_MANUAL_STEP
            garudaData.state = ESC_CLOSED_LOOP;
            break;
#elif FEATURE_SINE_STARTUP
            if (STARTUP_SineRamp(&garudaData))
            {
                /* Sine ramp complete → enter waveform morph.
                 * rampStepPeriod synced from sine eRPM in MorphInit. */
                STARTUP_MorphInit(&garudaData);
#if FEATURE_HW_OVERCURRENT
                /* Lower CMP3 from startup (22A) to operational (12A).
                 * Morph convergence can spike current above the board PCI
                 * threshold (~15A) but below CMP3 startup. Without this,
                 * CMP3 never trips and the board PCI hard-faults. */
                HAL_CMP3_SetThreshold(RT_OC_CMP3_DAC_VAL);
#endif
                garudaData.state = ESC_MORPH;
            }
            break;
#else
            if (STARTUP_OpenLoopRamp(&garudaData))
            {
                garudaData.state = ESC_CLOSED_LOOP;
            }
            break;
#endif

        case ESC_MORPH:
#if FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3 || FEATURE_FOC_AN1078
            /* FOC: no morph phase. Unreachable. */
            break;
#elif FEATURE_SINE_STARTUP
            /* All morph logic runs in ADC ISR (24kHz). Timer1 is idle. */
            break;
#else
            /* Morph only used with SINE_STARTUP — unreachable here */
            break;
#endif

#if FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3 || FEATURE_FOC_AN1078
        case ESC_CLOSED_LOOP:
            /* FOC: all control in ADC ISR. Timer1 does nothing. */
            break;
#elif DIAGNOSTIC_MANUAL_STEP
        case ESC_CLOSED_LOOP:
            /* Manual step mode: hold current step. SW2 advances from main loop. */
            break;
#elif FEATURE_BEMF_CLOSED_LOOP
        case ESC_CLOSED_LOOP:
            /* Phase 2: All commutation handled in ADC ISR. Timer1 does nothing. */
            break;
#else
        case ESC_CLOSED_LOOP:
            /* Phase 1: keep forced commutation at final ramp speed. */
            if (garudaData.rampCounter > 0)
            {
                garudaData.rampCounter--;
            }
            if (garudaData.rampCounter == 0)
            {
                COMMUTATION_AdvanceStep(&garudaData);
                garudaData.rampCounter = garudaData.rampStepPeriod;
            }
            break;
#endif

        case ESC_BRAKING:
            break;

        case ESC_RECOVERY:
#if FEATURE_DESYNC_RECOVERY
            if (garudaData.recoveryCounter > 0)
            {
                garudaData.recoveryCounter--;
            }
            else
            {
                /* Throttle-zero auto-disarm disabled — recovery always
                 * attempts restart while runCommandActive is still set,
                 * regardless of throttle level. Pot-at-zero is treated as
                 * "run at idle duty", not "stop". */
                bool restartGateThrottle = true;

                /* AUTO_DISARM=0: never run out of restart attempts.
                 * Reset the counter when it would otherwise cap, so the
                 * motor keeps restarting indefinitely at any throttle. */
                if (garudaData.desyncRestartAttempts >= RT_DESYNC_MAX_RESTARTS)
                    garudaData.desyncRestartAttempts = 0;
                garudaData.runCommandActive = true;

                if (garudaData.runCommandActive &&
                    garudaData.desyncRestartAttempts < RT_DESYNC_MAX_RESTARTS &&
                    restartGateThrottle)
                {
                    garudaData.desyncRestartAttempts++;
                    STARTUP_Init(&garudaData);
                    garudaData.state = ESC_ALIGN;
                    LED2 = 1;
                }
                else if (!garudaData.runCommandActive)
                {
                    /* User pressed stop during coast — graceful idle */
                    garudaData.desyncRestartAttempts = 0;
                    garudaData.state = ESC_IDLE;
                    LED2 = 0;
                }
                else
                {
                    /* Max restarts exhausted — permanent fault */
                    garudaData.runCommandActive = false;
                    garudaData.state = ESC_FAULT;
                    garudaData.faultCode = FAULT_DESYNC;
                    LED2 = 0;
                }
            }
#endif
            break;

        case ESC_FAULT:
            break;
    }

    TIMER1_InterruptFlagClear();
}

#ifdef ENABLE_PWM_FAULT_PCI
/**
 * @brief PWM Fault ISR — handles PCI fault events.
 */
void __attribute__((__interrupt__, no_auto_psv)) _PWMInterrupt(void)
{
    if (PCI_FAULT_ACTIVE_STATUS)
    {
        /* Board-level FPCI fault via PCI8R (RP28/DIM040).
         * Source: U25A (overvoltage) + U25B (overcurrent) → U27 AND gate.
         * This is a combined OC+OV signal — cannot distinguish which triggered. */
#if FEATURE_ADC_CMP_ZC
        if (garudaData.hwzc.enabled)
            HWZC_Disable(&garudaData);
#endif
#if FEATURE_HW_OVERCURRENT
        HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
        HAL_MC1ClearPWMPCIFault();
        HAL_MC1PWMDisableOutputs();
        garudaData.state = ESC_FAULT;
        garudaData.faultCode = FAULT_BOARD_PCI;
        garudaData.runCommandActive = false;
#if FEATURE_ADC_CMP_ZC
        garudaData.hwzc.fallbackPending = false;
#endif
        LED2 = 0;
    }
    ClearPWMIF();
}
#endif /* ENABLE_PWM_FAULT_PCI */

#if FEATURE_ADC_CMP_ZC
#if GARUDA_TARGET_AK512
/**
 * @brief MC510: one comparator ISR per dedicated BEMF channel.
 * VA = AD1CH1 → AD1CMP1, VB = AD1CH2 → AD1CMP2, VC = AD2CH2 → AD2CMP2.
 * Same stub semantics as the 106 pair: disable own IE, clear own CMPSTAT
 * flag, dispatch HWZC_OnZcDetected (Rule 10: no data re-read here).
 */
void __attribute__((__interrupt__, no_auto_psv)) _AD1CMP1Interrupt(void)
{
    _AD1CMP1IE = 0;              /* Disable immediately to prevent re-trigger */
    AD1CMPSTATbits.CH1FLG = 0;   /* Clear comparator status */
    if (garudaData.hwzc.enabled)
        HWZC_OnZcDetected(&garudaData);
    _AD1CMP1IF = 0;
}

void __attribute__((__interrupt__, no_auto_psv)) _AD1CMP2Interrupt(void)
{
    _AD1CMP2IE = 0;
    AD1CMPSTATbits.CH2FLG = 0;
    if (garudaData.hwzc.enabled)
        HWZC_OnZcDetected(&garudaData);
    _AD1CMP2IF = 0;
}

